app/Controllers/Beranda/ArtikelController.php

SELECT *
FROM `artikel`
ORDER BY `tanggal` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
    public function index()
    {
        helper('text');
        $data = [
            'artikel' => $this->artikelModel->orderBy('tanggal', 'DESC')->paginate(6),
            'pager' => $this->artikelModel->pager
        ];