app/Controllers/Beranda/DokumenController.php

    public function index()
    {
        $model = new DokumenModel();
        $data['dokumen'] = $model->orderBy('tanggal_upload', 'DESC')->findAll();
---
SELECT *
FROM `dokumen`
ORDER BY `tanggal_upload` DESC