app/Controllers/Beranda/ProkerController.php

SELECT *
FROM `proker`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `proker`
---
    public function index()
    {
        helper('text');
        $model = new \App\Models\ProkerModel();
    $data = [
        'proker' => $model->paginate(6), // 6 data per halaman
        'pager' => $model->pager,
    ];