app/Controllers/Beranda/SejarahController.php

SELECT *
FROM `sejarah`
 LIMIT 1
---
    public function index()
    {
        $model = new SejarahModel();
        $profil = $model->first();