app/Controllers/Beranda/StrukturPengurusController.php

SELECT *
FROM `struktur_pengurus`
---
    public function index()
    {
        $model = new StrukturPengurusModel();
        $data['pengurus'] = $model->findAll(); // ambil semua pengurus