app/Controllers/Admin/AdminController.php

SELECT *
FROM `admin`
---
    public function index()
    {
        $data['admins'] = $this->adminModel->findAll();