app/Controllers/Admin/ArtikelController.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->findAll();