app/Controllers/Admin/DokumenController.php

    public function index()
    {
        $model = new DokumenModel();
        $data['dokumen'] = $model->findAll();
---
SELECT *
FROM `dokumen`