app/Controllers/Admin/ProkerController.php

    public function index()
    {
        $model = new ProkerModel();
        $data['proker'] = $model->findAll();
---
SELECT *
FROM `proker`