app/Controllers/Admin/SejarahController.php

    public function index()
    {
        $data['data'] = $this->sejarahModel->findAll();
---
SELECT *
FROM `sejarah`