app/Controllers/Admin/VisimisiController.php

    public function index()
    {
        $model = new VisimisiModel();
        $data['visimisi'] = $model->findAll();
---
SELECT *
FROM `visi_misi`