app/Controllers/AuthController.php

    public function loginPost()
    {
        $model = new AdminModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'hmtiperiode25'
 LIMIT 1